#include "apue.h"
int globvar = 6; /* гло­баль­ная пе­ре­мен­ная в сег­мен­те ини­циа­ли­зи­ро­ван­ных дан­ных */
int main(void)
{
int var; /* ло­каль­ная пе­ре­мен­ная в сте­ке */
pid_t pid;
var = 88;
printf("пе­ред вы­зо­вом функ­ции vfork\n"); /* мы не сбра­сы­ва­ем бу­фе­ры stdout */
if ((pid = vfork()) < 0) {
err_sys("ошиб­ка вы­зо­ва функ­ции vfork");
} else if (pid == 0) {
/* до­чер­ний про­цесс */
globvar++;
/* из­ме­нить пе­ре­мен­ные */
var++;
_exit(0);
/* за­вер­ше­ние до­чер­не­го про­цес­са */
}
/*
* Ро­ди­тель­ский про­цесс про­дол­жит ра­бо­ту от­сю­да.
*/
printf("pid = %ld, globvar = %d, var = %d\n", (long)getpid(), globvar, var);
exit(0);
}
